#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-43xtSsEJtk2ShHjo

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3: Refreshing state... [id=cdktf-provider-pagerduty]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfproviderarchive_repo_F28A4A49: Refreshing state... [id=cdktf-provider-archive]
github_repository.repos_cdktfproviderlocal_repo_4D7B21AD: Refreshing state... [id=cdktf-provider-local]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_5D9D084F: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_E790E307: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU=]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_464237BB: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY=]
github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE=]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_2FD08746: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA=]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_095BADA0: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_3167ABFB: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg=]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ=]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4D61E54C: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderprojectrepo014C3CE2namenpmtoken_CA780E66: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY=]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_6943A63C: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_FB1AFDA6: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM=]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_049CB040: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenugetapikey_E9E6328B: Refreshing state... [id=cdktf-provider-pagerduty:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwinepassword_F7EDB801: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3namenpmtoken_19C84FCF: Refreshing state... [id=cdktf-provider-pagerduty:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTA=]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nameghtoken_8F70281E: Refreshing state... [id=cdktf-provider-pagerduty:GH_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderpagerdutyrepo0AF36FE3nametwineusername_D4431A3B: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_USERNAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwinepassword_33ED56FC: Refreshing state... [id=cdktf-provider-archive:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenugetapikey_0C6A5E62: Refreshing state... [id=cdktf-provider-archive:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49namenpmtoken_38D4F0D3: Refreshing state... [id=cdktf-provider-archive:NPM_TOKEN]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nameghtoken_526ABDB8: Refreshing state... [id=cdktf-provider-archive:GH_TOKEN]
github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTU=]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderarchiverepoF28A4A49nametwineusername_83726418: Refreshing state... [id=cdktf-provider-archive:TWINE_USERNAME]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwineusername_4593AAD7: Refreshing state... [id=cdktf-provider-local:TWINE_USERNAME]
github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnameghtoken_4EE677D1: Refreshing state... [id=cdktf-provider-local:GH_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnametwinepassword_B5A42AA4: Refreshing state... [id=cdktf-provider-local:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTg=]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenpmtoken_F3E5179B: Refreshing state... [id=cdktf-provider-local:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderlocalrepo4D7B21ADnamenugetapikey_B157A230: Refreshing state... [id=cdktf-provider-local:NUGET_API_KEY]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B: Refreshing state... [id=3949435:cdktf-provider-archive]
github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60: Refreshing state... [id=3949435:cdktf-provider-local]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F: Refreshing state... [id=3949435:cdktf-provider-pagerduty]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_managingteam_455152F1" {
      ~ etag       = "W/\"5ae112ac14f1d330e64c8d0ac713360f1d6ebfb33acd795b7a3a1509a906d36d\"" -> "W/\"2a35d1e5bf488c6d5ad72b2a6c698be55651215bd14a26370d5931f1a671adca\""
        id         = "3949435:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_managingteam_F33627F0" {
      ~ etag       = "W/\"055ae03e5e95c63a64559c48c09f1488ec89554dd71f581f739b0d32e31be48e\"" -> "W/\"40ed352c9ef7b60efa3b8785ea276746f501074b3043b1439588532ad63b09fe\""
        id         = "3949435:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_managingteam_9604098C" {
      ~ etag       = "W/\"e133e34e7b1f128fed6f1b2ae8e3732b917c96ffe7925dd4e55efac0b2d08b40\"" -> "W/\"a3ba7655856d59826e813f2d8d0f752c89dc1c003fcb9e45b05868d8a0f4e608\""
        id         = "3949435:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      ~ etag                   = "W/\"c4ac458ae5f7e734d2c51b523277270efbaffa9f4f26861ad372f4d6c02c4260\"" -> "W/\"f6adbd32177a43222cd80dd6e394fb7a1db68cb188b49c8d98d3a87e87bd346f\""
        id                     = "cdktf-provider-pagerduty"
        name                   = "cdktf-provider-pagerduty"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_managingteam_FC9AAFD0" {
      ~ etag       = "W/\"bbf23acd676b31f02a4052786aa38aa175b2e08a878b4a2cb8094c3c82541c97\"" -> "W/\"311b1657658e5512d71f0f0641897a42868e8f1416d71c7124845220ffa555fe\""
        id         = "3949435:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_managingteam_0280CE60" {
      ~ etag       = "W/\"de207c08c83a165fefb23bdb5545c5a9c2dfaa1cda3b8b725d53175a2e03aa53\"" -> "W/\"0e7f416b70b8fa8b8206295b2464c0730e212db8a3ae3c10dad2e65faa0951b5\""
        id         = "3949435:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderpagerduty_mainprotection_18096071" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTA="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_managingteam_C1D890C2" {
      ~ etag       = "W/\"7398610fc9b8e38f75e2424907c809337bbe9d4da01d5a4f85076f7c352896a9\"" -> "W/\"10221af98353fd9e008c8f03c7739f3f87d5ca1986fbe940c9ee1c776f80f0dc\""
        id         = "3949435:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_managingteam_94F669F5" {
      ~ etag       = "W/\"61cc64b37d592ccf6cfeb7ae30020747137cb97216b162df2498e9f77d462d07\"" -> "W/\"1948b7a8c557a3881ff220a324dc090fd376327d9899c8e92a52233fc31c4c92\""
        id         = "3949435:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderlocal_repo_4D7B21AD has been changed
  ~ resource "github_repository" "repos_cdktfproviderlocal_repo_4D7B21AD" {
      ~ etag                   = "W/\"21084ecc49ec07864739beab8262dd8703a76ff177456afdb828d0bb5c8b7c8d\"" -> "W/\"1d728c5431b128872163e2ddf5b4f8501ff28d5908e7c2f383862d14307c08f8\""
        id                     = "cdktf-provider-local"
        name                   = "cdktf-provider-local"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_managingteam_26C4AF5F" {
      ~ etag       = "W/\"3dfbeac708a12c3215da5c13401428e54adac4968e74565b9e42d3f15aade6b5\"" -> "W/\"903966a36295ce2c94ebb93eddbc05a7c37747f2650a06b3ba9f4d8cadf64ca5\""
        id         = "3949435:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_managingteam_E627D265" {
      ~ etag       = "W/\"cda2cc0645feb28ab974b150ef27e06c924b6764fec12db4bb755477a355b991\"" -> "W/\"3737c5cdd57a92fa65d7941757cd2e0cb835f4d5eacd569099291b213366f224\""
        id         = "3949435:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_managingteam_86F83671 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_managingteam_86F83671" {
      ~ etag       = "W/\"2ec58388d53207ba31ba72d9d3741836f64f46eadec261b820a4dd36b23e64c9\"" -> "W/\"3eaed5cb6468150246810801393b298d5599f52d617b7496a7a935869612639e\""
        id         = "3949435:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_managingteam_DD2D4282" {
      ~ etag       = "W/\"902f6a6454a23da8e29d132282a5a4b00b8ed937cf63730958e1e687195370d7\"" -> "W/\"06cb1ed9fab014d395271ea103ba0eb56372616b43f45f6886052528c8ee53a2\""
        id         = "3949435:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderproject_repo_014C3CE2 has been changed
  ~ resource "github_repository" "repos_cdktfproviderproject_repo_014C3CE2" {
      ~ etag                   = "W/\"707fdb5b30e3ec2c95231c53f3ea26ecd220553c03a149ae1e5a492969392f5f\"" -> "W/\"5da4b7d949911751c654ded0ea089b114dd2b5f35a9f97eee0b4d40417ab45b0\""
        id                     = "cdktf-provider-project"
        name                   = "cdktf-provider-project"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 has been changed
  ~ resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      ~ etag                   = "W/\"ccb703c9c31d570e1e15928fbe3e740b58d732b20752303eb28c52726c5f6a7f\"" -> "W/\"051d6aae8da762117e6fcb33426673478baec810200b1e6b3f1f23fe63e31f20\""
        id                     = "cdktf-provider-archive"
        name                   = "cdktf-provider-archive"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"4fd4cf19538246ac7112c2d626c1f42445ca62ac54b20eea37fe610203d61197\"" -> "W/\"ede6ab61b9a00b4e2ad9a9cec1f3a89142252e4263b9a2471c2040cee9778a49\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"2f62ecbe7b5eb8cada0e9ec3287902c56e1b60809a65540a91b741ee2ac6b03c\"" -> "W/\"b1707198f15ef830218d4acfc37de6a30eca5de398fed5202e7c878cbd5065a2\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderarchive_mainprotection_71039C33" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTU="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_managingteam_9DD6F017" {
      ~ etag       = "W/\"61f24bc9931d038ab53ef391244b81832e200ee99abc3da70d9ace9f7f2aba65\"" -> "W/\"821f59b0709775cb3c0c8041ba9fe4515c49ec133379643fcaf50d3cca7d6903\""
        id         = "3949435:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763 has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderlocal_mainprotection_2BB09763" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTg="
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_managingteam_9F25FC7B" {
      ~ etag       = "W/\"fe8b42b7a21b55143e9a58191f5ff80b14573a866d7c872423b2cdc0a479e499\"" -> "W/\"177016766d1bf169744bfc2f92ce9696832224aa8ad8f799d2a51e6be8656b41\""
        id         = "3949435:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_issue_label.repos_cdktfproviderarchive_automergelabel_869BB088 will be created
  + resource "github_issue_label" "repos_cdktfproviderarchive_automergelabel_869BB088" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-archive"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovideraws_automergelabel_303B185E will be created
  + resource "github_issue_label" "repos_cdktfprovideraws_automergelabel_303B185E" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-aws"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderazurerm_automergelabel_9D468D52 will be created
  + resource "github_issue_label" "repos_cdktfproviderazurerm_automergelabel_9D468D52" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdatadog_automergelabel_EBE4A0F2 will be created
  + resource "github_issue_label" "repos_cdktfproviderdatadog_automergelabel_EBE4A0F2" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-datadog"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderdocker_automergelabel_70197107 will be created
  + resource "github_issue_label" "repos_cdktfproviderdocker_automergelabel_70197107" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-docker"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderexternal_automergelabel_88E85FD0 will be created
  + resource "github_issue_label" "repos_cdktfproviderexternal_automergelabel_88E85FD0" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-external"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergithub_automergelabel_CB4CF729 will be created
  + resource "github_issue_label" "repos_cdktfprovidergithub_automergelabel_CB4CF729" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-github"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidergoogle_automergelabel_359F63C4 will be created
  + resource "github_issue_label" "repos_cdktfprovidergoogle_automergelabel_359F63C4" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-google"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderkubernetes_automergelabel_1FA4EB21 will be created
  + resource "github_issue_label" "repos_cdktfproviderkubernetes_automergelabel_1FA4EB21" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-kubernetes"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderlocal_automergelabel_C0E7761B will be created
  + resource "github_issue_label" "repos_cdktfproviderlocal_automergelabel_C0E7761B" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfprovidernull_automergelabel_EAE50ED1 will be created
  + resource "github_issue_label" "repos_cdktfprovidernull_automergelabel_EAE50ED1" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-null"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderpagerduty_automergelabel_C6025DF6 will be created
  + resource "github_issue_label" "repos_cdktfproviderpagerduty_automergelabel_C6025DF6" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderproject_automergelabel_314CBFA5 will be created
  + resource "github_issue_label" "repos_cdktfproviderproject_automergelabel_314CBFA5" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-project"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfproviderrandom_automergelabel_94219122 will be created
  + resource "github_issue_label" "repos_cdktfproviderrandom_automergelabel_94219122" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-random"
      + url        = (known after apply)
    }

  # github_issue_label.repos_cdktfrepositorymanager_automergelabel_67A6BDF7 will be created
  + resource "github_issue_label" "repos_cdktfrepositorymanager_automergelabel_67A6BDF7" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-repository-manager"
      + url        = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "github-token" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*